/* AirDeviceViewController.m */
"--" = "--";

/* AirDeviceBindViewController.m */
"Wi-Fi网络未连接，请连接Wi-Fi" = "Wi-Fi网络未连接，请连接Wi-Fi";

/* ChangeNameViewController.m */
"不能与其他设备同名，请重新设置新的名称" = "不能与其他设备同名，请重新设置新的名称";

/* AirDeviceViewController.m
   AppDelegate.m
   Utility.m */
"中" = "中";

/* NewHistoryViewController.m */
"今天" = "今天";

/* AirDeviceViewController.m
   AppDelegate.m
   Utility.m */
"优" = "优";

/* IRDeviceModelSelectionViewController.m */
"使用净化器遥控器对净化器按开关键" = "使用净化器遥控器对净化器按开关键";

/* HelpViewController.m */
"使用攻略" = "使用攻略";

/* IRDeviceModelSelectionViewController.m */
"使用空调遥控器对空调按开关键" = "使用空调遥控器对空调按开关键";

/* CustomModelViewController.m */
"保存红外码失败，请稍后再试" = "保存红外码失败，请稍后再试";

/* SettingViewController.m */
"信息中心" = "信息中心";

/* ChangeNameViewController.m */
"修改空气盒子名称失败" = "修改空气盒子名称失败";

/* HelpViewController.m */
"关于" = "关于";

/* AirDeviceViewController.m */
"关闭智能调节" = "关闭智能调节";

/* AirConditionViewController.m
   AirDeivceManageViewController.m
   AirDeviceViewController.m
   DeviceManagementViewController.m */
"净化器" = "净化器";

/* IRDeviceModelSelectionViewController.m */
"净化器手动识别绑定" = "净化器手动识别绑定";

"空调手动识别绑定"="空调手动识别绑定";
/* IRDeviceModelSelectionViewController.m */
"净化器是否成功开机?" = "净化器是否成功开机?";

/* IRDeviceModelSelectionViewController.m */
"净化器识别绑定" = "净化器识别绑定";

/* IRDeviceModelSelectionViewController.m */
"净化器识别绑定失败" = "净化器识别绑定失败";

/* AirDeivceManageViewController.m */
"分享到微信" = "分享到微信";

"分享失败" = "分享失败";
/* AppDelegate.m */
"分享到微信失败" = "分享到微信失败";

/* AirDeivceManageViewController.m */
"分享到新浪微博" = "分享到新浪微博";

/* SetTimeCell.m */
"分钟" = "分钟";

/* DeviceManagementViewController.m */
"删除失败" = "删除失败";

/* CustomModelViewController.m */
"删除红外码失败，请稍后再试" = "删除红外码失败，请稍后再试";

/* FeedbackViewController.m */
"反馈信息不能超过256个字符" = "反馈信息不能超过256个字符";

/* FeedbackViewController.m */
"反馈内容不能为空!" = "反馈内容不能为空!";

/* FeedbackViewController.m */
"问题反馈" = "问题反馈";

/* IRDeviceModelSelectionViewController.m */
"发送开机命令成功" = "发送开机命令成功";

/* AirDeivceManageViewController.m
   AirDeviceViewController.m
   DeviceManagementViewController.m */
"取消" = "取消";

/* DeviceManagementViewController.m */
"只剩下1台绑定的设备,删除后将重新登录帐号" = "只剩下1台绑定的设备,删除后将重新登录帐号";

/* CustomModelViewController.m */
"名称重复" = "名称重复";

/* SettingViewController.m */
"城市定位" = "城市定位";
"城市定位:" = "城市定位:";

/* InfoCenterViewController.m */
"增值信息" = "增值信息";

/* SettingViewController.m */
"天气提醒" = "天气提醒";

/* AirDeviceViewController.m */
"太差啦" = "太差啦";

/* LocationController.m */
"定位失败，请重试" = "定位失败，请重试";

/* SettingViewController.m */
"室内提醒" = "室内提醒";

/* MainViewController.m
   RegisterViewController.m */
"密码不能为空" = "密码不能为空";

/* MainViewController.m
   RegisterViewController.m */
"请输入正确的密码格式,长度6-20位的数字或字母" = "请输入正确的密码格式,长度6-20位的数字或字母";

/* MainViewController.m
   RegisterViewController.m */
"密码由字母或数字组成，不能包含其他符号" = "密码由字母或数字组成，不能包含其他符号";

/* AirDeviceViewController.m */
"寒冷" = "寒冷";

/* SetTimeCell.m */
"小时" = "小时";

/* AirDeviceViewController.m
   AppDelegate.m
   Utility.m */
"差" = "差";

/* AirDeviceBindViewController.m */
"已经绑定当前所有空气盒子" = "已经绑定当前所有空气盒子";

/* IRDeviceModelSelectionViewController.m */
"已绑定净化器" = "已绑定净化器";

/* IRDeviceModelSelectionViewController.m */
"已绑定空调" = "已绑定空调";

/* AirDeviceBindViewController.m */
"已连接至WIFI" = "已连接至WIFI";

/* MainViewController.m
   RegisterViewController.m */
"帐号不能为空" = "帐号不能为空";

/* SettingViewController.m */
"帮助" = "帮助";

/* HelpViewController.m */
"常见问题与解答" = "常见问题与解答";

/* AirDeviceViewController.m */
"干燥" = "干燥";

/* IRDeviceModelSelectionViewController.m */
"并使用净化器遥控器对空气盒子按开关键" = "并使用净化器遥控器对空气盒子按开关键";

/* IRDeviceModelSelectionViewController.m */
"并使用空调遥控器对空气盒子按开关键" = "并使用空调遥控器对空气盒子按开关键";

/* InfoCenterViewController.m */
"开启免打扰模式" = "开启免打扰模式";

/* NewHistoryViewController.m */
"当前" = "当前";

/* AppDelegate.m */
"当前已是最新版本" = "当前已是最新版本";

/* AirConditionViewController.m */
"当前设备不在线" = "当前设备不在线";

/* SettingViewController.m */
"您是否要删除该城市?" = "您是否要删除该城市?";

/* AirDeivceManageViewController.m */
"您的手机没有安装微信客户端" = "您的手机没有安装微信客户端";

/* HelpViewController.m
   SettingViewController.m */
"意见反馈" = "意见反馈";

/* FeedbackViewController.m */
"提交反馈失败，请重试" = "提交反馈失败，请重试";

/* InfoCenterViewController.m */
"提醒信息" = "提醒信息";

/* AirDeviceBindViewController.m */
"搜索设备" = "搜索设备";

/* CustomModelViewController.m */
"操作指令发送成功" = "操作指令发送成功";

/* HelpViewController.m */
"操作指引将被重新显示" = "操作指引将被重新显示";

/* SettingViewController.m */
"是否注销?" = "是否注销?";

/* AirDeviceViewController.m */
"智能调节" = "智能调节";

/* AirDeviceViewController.m */
"有污染" = "有污染";

/* AirDeviceViewController.m */
"有点差" = "有点差";

/* AirDeivceManageViewController.m */
"来自海尔空气盒子" = "来自海尔空气盒子";

/* AirDeivceManageViewController.m */
"根据空气检测结果，云服务会远程自动控制绑定的空调或净化器" = "根据空气检测结果，云服务会远程自动控制绑定的空调或净化器";

/* AirDeviceBindViewController.m */
"检测WiFi中..." = "检测WiFi中...";

/* AirDeviceBindViewController.m */
"检测网络中..." = "检测网络中...";

/* AirConditionViewController.m */
"模式下载失败" = "模式下载失败";

/* AirConditionViewController.m */
"模式设置失败" = "模式设置失败";

/* IRDeviceModelSelectionViewController.m */
"正在发送开机命令" = "正在发送开机命令";

/* AirBoxListViewController.m */
"正在登录" = "正在登录";

/* AirBoxListViewController.m */
"正在获取空气盒子列表" = "正在获取空气盒子列表";

/* AirBoxListViewController.m */
"正在验证用户是否激活" = "正在验证用户是否激活";

/* AirDeviceViewController.m */
"正常" = "正常";

/* AirConditionViewController.m */
"没有找到相应红外命令" = "没有找到相应红外命令";

/* AirDeviceBindViewController.m */
"没有搜索到空气盒子" = "没有搜索到空气盒子";

/* CustomModelViewController.m
   IRDeviceModelSelectionViewController.m */
"没有收到红外命令" = "没有收到红外命令";

/* AirDeivceManageViewController.m */
"没有登录新浪微博帐号,请到系统设置里面进行登录" = "没有登录新浪微博帐号,请到系统设置里面进行登录";

/* AccountActivationViewController.m
   RegisterViewController.m */
"注册失败" = "注册失败";

/* AccountActivationViewController.m */
"注册成功" = "注册成功";

/* SettingViewController.m */
"注销" = "注销";

/* SettingViewController.m */
"注销失败" = "注销失败";

/* AirDeviceViewController.m */
"潮湿" = "潮湿";

/* AirDeviceViewController.m */
"炎热" = "炎热";

/* SettingViewController.m */
"版本检测" = "版本检测";

/* AppDelegate.m */
"版本检测失败" = "版本检测失败";

/* MainViewController.m */
"用户名或密码错误" = "用户名或密码错误";

/* AppDelegate.m */
"以后再说" = "以后再说";

/* MainViewController.m */
"激活码不正确，请重新输入" = "激活码不正确，请重新输入";

/* AirBoxListViewController.m
   MainViewController.m */
"登录失败" = "登录失败";

/* MainViewController.m */
"登陆失败" = "登陆失败";

/* SDKRequestManager.m */
"确定" = "确定";

/* DeviceManagementViewController.m */
"确定删除所选内容" = "确定删除所选内容";

/* DeviceManagementViewController.m */
"空气盒子不在线，请稍后再试" = "空气盒子不在线，请稍后再试";

/* IRDeviceModelSelectionViewController.m */
"空气盒子已尝试开启净化器，请确认净化器是否开启?" = "空气盒子已尝试开启净化器，请确认净化器是否开启?";

/* IRDeviceModelSelectionViewController.m */
"空气盒子已尝试开启空调，是否听到空调响?" = "空气盒子已尝试开启空调，是否听到空调响?";

/* AppDelegate.m */
"空气盒子应用新版本上线啦!" = "空气盒子应用新版本上线啦!";

/* DeviceManagementViewController.m */
"空气盒子解除绑定失败!" = "空气盒子解除绑定失败!";

/* AirDeivceManageViewController.m
   AirDeviceViewController.m
   DeviceManagementViewController.m */
"空调" = "空调";

/* IRDeviceModelSelectionViewController.m */
"空调是否成功开机?" = "空调是否成功开机?";

/* IRDeviceModelSelectionViewController.m */
"空调识别绑定" = "空调识别绑定";

/* IRDeviceModelSelectionViewController.m */
"空调识别绑定失败" = "空调识别绑定失败";

/* IRDeviceModelSelectionViewController.m */
"红外学习条件不满足(需手机与空气盒子连接至同一无线路由器),请手动选择绑定" = "红外学习条件不满足(需手机与空气盒子连接至同一无线路由器),请手动选择绑定";

/* CustomModelViewController.m */
"红外学习需手机与空气盒子连接至同一无线路由器，请连接后再次尝试" = "红外学习需手机与空气盒子连接至同一无线路由器，请连接后再次尝试";

/* AirDeviceBindViewController.m */
"绑定设备" = "绑定设备";

/* AirBoxListViewController.m
   MainViewController.m */
"网络异常,请稍后再试" = "网络异常,请稍后再试";

/* AppDelegate.m */
"网络异常,请检查网络设置!" = "网络异常,请检查网络设置!";

/* AirDeviceBindViewController.m */
"网络连接正常" = "网络连接正常";

/* RetrievePasswordWebViewController.m */
"网页加载失败" = "网页加载失败";

/* AirDeviceViewController.m
   AppDelegate.m
   Utility.m */
"良" = "良";

/* NewHistoryViewController.m */
"获取数据失败,请检查网络" = "获取数据失败,请检查网络";

/* AccountActivationViewController.m */
"获取激活码失败，请稍候重试" = "获取激活码失败，请稍候重试";

/* AirDeviceViewController.m */
"获取空气质量数据失败" = "获取空气质量数据失败";

/* AirDeivceManageViewController.m
   AirDeviceViewController.m */
"获取红外设备失败" = "获取红外设备失败";

/* IRDeviceModelSelectionViewController.m */
"获取设备型号列表失败" = "获取设备型号列表失败";

/* DeviceManagementViewController.m */
"确定解除该设备绑定" = "确定解除该设备绑定";

/* InfoCenterViewController.m
   SDKRequestManager.m */
"警告信息" = "警告信息";

/* InfoCenterViewController.m */
"订阅信息" = "订阅信息";

/* ChangeNameViewController.m */
"设备名称不能为空" = "设备名称不能为空";

/* ChangeNameViewController.m */
"设备名称不能包含特殊字符" = "设备名称不能包含特殊字符";

/* ChangeNameViewController.m */
"设备名称不能超过16个字符" = "设备名称不能超过16个字符";

/* DeviceManagementViewController.m
   SettingViewController.m */
"设备管理" = "设备管理";

/* InfoCenterViewController.m */
"设置信息铃声" = "设置信息铃声";

/* AirDeivceManageViewController.m
   AirDeviceViewController.m */
"选择添加的设备类型" = "选择添加的设备类型";

/* LocationController.m */
"请在系统设置中打开“定位服务”来允许“空气盒子”确定您的位置(设置-隐私-定位服务)" = "请在系统设置中打开“定位服务”来允许“空气盒子”确定您的位置(设置-隐私-定位服务)";

/* AirDeviceBindViewController.m */
"请检测路由器密码是否正确" = "请检测路由器密码是否正确";

/* IRDeviceModelSelectionViewController.m */
"请确保净化器和空气盒子连接电源" = "请确保净化器和空气盒子连接电源";

/* IRDeviceModelSelectionViewController.m */
"请确保空调和空气盒子连接电源" = "请确保空调和空气盒子连接电源";

/* RegisterViewController.m */
"请确认您已经阅读了《用户使用协议》" = "请确认您已经阅读了《用户使用协议》";

/* AccountActivationViewController.m */
"请稍后再试" = "请稍后再试";

/* FeedbackViewController.m */
"请输入您的空调或净化器型号，我们会尽快开发支持该型号设备，谢谢" = "请输入您的空调或净化器型号，我们会尽快开发支持该型号设备，谢谢";

/* FeedbackViewController.m */
"请告知您的路由器品牌及型号，我们会尽快处理" = "请告知您的路由器品牌及型号，我们会尽快处理";

/* FeedbackViewController.m */
"请输入意见或建议" = "请输入意见或建议";

/* CustomModelViewController.m */
"请输入指令名称" = "请输入指令名称";

/* MainViewController.m
   RegisterViewController.m */
"请输入正确的手机号码格式" = "请输入正确的手机号码格式";

/* AccountActivationViewController.m */
"请输入激活码" = "请输入激活码";

/* RegisterViewController.m */
"请输入确认密码" = "请输入确认密码";

/* AirDeviceBindViewController.m */
"请输入路由器密码" = "请输入路由器密码";

/* FeedbackViewController.m */
"谢谢您的反馈!" = "谢谢您的反馈!";

/* RegisterViewController.m */
"输入密码不一致" = "输入密码不一致";

/* AirDeviceViewController.m */
"还不错" = "还不错";

/* AirDeivceManageViewController.m */
"连接失败,请确认空气盒子和路由器正常连接到互联网;可尝试重启空气盒子和路由器来解决此问题" = "连接失败,请确认空气盒子和路由器正常连接到互联网;可尝试重启空气盒子和路由器来解决此问题";

/* IRDeviceModelSelectionViewController.m */
"选择净化器" = "选择净化器";

/* IRDeviceModelSelectionViewController.m */
"选择空调" = "选择空调";

/* DeviceManagementViewController.m */
"选择设备类型" = "选择设备类型";

/* IRDeviceModelSelectionViewController.m */
"配置成功" = "配置成功";

/* AccountActivationViewController.m */
"重新获取" = "重新获取";

/* AirDeviceViewController.m */
"非常好" = "非常好";

/* AirBoxListViewController.m */
"验证失败" = "验证失败";






//--------------------------------ybyao--------------//
/* WeatherMainViewController.m */
//dataRequset:forecast5 week//
"现在"="现在";
"周一" = "周一";
"周二" = "周二";
"周三" = "周三";
"周四" = "周四";
"周五" = "周五";
"周六" = "周六";
"周日" = "周日";
/* WeatherMainViewController.m */
//dataRequset:forecast5 weather//

"晴"="晴";
"多云"="多云";
"阴"="阴";
"阵雨"="阵雨";
"雷阵雨"="雷阵雨";
"雷阵雨伴有冰雹"="雷阵雨伴有冰雹";
"雨夹雪"="雨夹雪";
"小雨"="小雨";
"中雨"="中雨";
"大雨"="大雨";
"暴雨"="暴雨";
"大暴雨"="大暴雨";
"特大暴雨"="特大暴雨";
"阵雪"="阵雪";
"小雪"="小雪";
"中雪"="中雪";
"大雪"="大雪";
"暴雪"="暴雪";
"雾"="雾";
"冻雨"="冻雨";
"沙尘暴"="沙尘暴";
"小到中雨"="小到中雨";
"中到大雨"="中到大雨";
"大到暴雨"="大到暴雨";
"暴雨到大暴雨"="暴雨到大暴雨";
"大暴雨到特大暴雨"="大暴雨到特大暴雨";
"小到中雪"="小到中雪";
"中到大雪"="中到大雪";
"大到暴雪"="大到暴雪";
"浮尘"="浮尘";
"扬沙"="扬沙";
"强沙尘暴"="强沙尘暴";
"霾"="霾";

//dataRequset:forecast5 wind_direction//
"无持续风向" = "无持续风向";
"东风" = "东风";
"西风"="西风";
"南风"="南风";
"北风"="北风";
"东北风" = "东北风";
"西北风"="西北风";
"东南风"="东南风";
"西南风"="西南风";
"旋转风"="旋转风";


//新增翻译：

"秒"="秒";

"知道了"="知道了";

"空气盒子"="空气盒子";

"舒适模式"="舒适模式";

"节能模式"="节能模式";

"无"="无";

"风力"="风力";

"制冷模式"="制冷模式";

"制热模式"="制热模式";

"智能调节"="智能调节";

"自动风速"="自动风速";

"低风速"="低风速";

"中风速"="中风速";

"高风速"="高风速";

"手动控制"="手动控制";

"正在刷新..."="正在刷新...";
"下拉可以刷新"="下拉可以刷新";
"松开立即刷新"="松开立即刷新";

"下载成功"="下载成功";


//dataRequset:forecast5 wind//
"微风" = "微风";
"级" = "级";




/* WeatherMainViewController.m */
//updateCurrentWeather


"优良"="优良";
"良好"="良好";
"轻度污染"="轻度污染";
"中度污染"="中度污染";
"重度污染"="重度污染";
"严重污染"="严重污染";

/* WeatherMainViewController.m */
//updateIndexView 28个指数
"中暑指数"="中暑指数";
"雨伞指数"="雨伞指数";
"约会指数"="约会指数";
"运动指数"="运动指数";
"心情指数"="心情指数";
"洗车指数"="洗车指数";
"风寒指数"="风寒指数";
"紫外线强度指数"="紫外线强度指数";
"旅游指数"="旅游指数";
"化妆指数"="化妆指数";
"空气污染扩散条件指数"="空气污染扩散条件指数";
"放风筝指数"="放风筝指数";
"啤酒指数"="啤酒指数";
"夜生活指数"="夜生活指数";
"美发指数"="美发指数";
"晾晒指数"="晾晒指数";
"路况指数"="路况指数";
"交通指数"="交通指数";
"划船指数"="划船指数";
"感冒指数"="感冒指数";
"逛街指数"="逛街指数";
"防晒指数"="防晒指数";
"钓鱼指数"="钓鱼指数";
"穿衣指数"="穿衣指数";
"舒适度指数"="舒适度指数";
"晨练指数"="晨练指数";
"息斯敏过敏指数"="息斯敏过敏指数";
"空调开启指数"="空调开启指数";


//---------ybyao
"紫外线指数"="紫外线指数";
"空调指数"="空调指数";
"污染扩散指数"="污染扩散指数";
//addCity函数
"最多添加9个城市"="最多添加9个城市";

"无风"="无风";
//index---level 指数水平
//"较少开启"="较少开启";
//"易发"="易发";
//"适宜"="适宜";
//"较不舒适"="less comfortable";
//"较舒适"="comfortable";
//"热"="hot";
//"较适宜"="It would be more appropriate";
//"强"="strong";
//"弱"="weak";
//"较弱"="Less weak";
//"适宜"="suitability";
//"少发"="Less to cause";
//"好"="good";
//"干燥"="dry";
//"极适宜"="";
//"一般"="fine";
//"去油"="Facial degreasing";
//"不带伞"="";
//index Content


// "CustomIndexViewController.m"
"最多添加九个指数"="最多添加九个指数";
"最少选择九个指数"="最少选择九个指数";

//"今日是否适宜开启空调"="Whether it's suitable for shopping.";
//"给您今日是否适宜晨练的建议"="morning execise recommendation.";
//"查询今日的舒适度"="Comfortable recommendation";
//"出行穿衣小贴士"="dressing recommendation";
//"给您今日是否适宜钓鱼的建议"="Whether it's suitable to fish.";
//"出行时的防晒小贴士"="Outdoor sun proofing recommendation.";
//"今日是否适宜逛街"="Whether it's suitable for shopping.";
//"今日是否容易感冒"="Fever protection recommendation";
//"今日是否适宜划船"="Whether it's suitable to boat";
//"开车出行的交通状况"="Traffic condition";
//"开车出行的路面状况"="Road Condition Recommendation";
//"是否适宜晾晒衣物"="Drying recommendation";
//"出行对于秀发的保护小贴士"="Outdoor hair protection recommendation";
//"是否适宜喝啤酒"="Whether it's suitable for beer.";
//"今日是否适宜放风筝"="Whether it's suitable to fly kite.";
//"出行空气污染提醒"="Outdoor air pollution tip.";
//"爱美人士的化妆建议"="Make-up Recommendation";
//"今日是否适宜去该城市旅游"="whether it's suitable for a tour to the city";
//"出行时的防紫外线小贴士"="Ultraviolet rays proof recommendation";
//"防寒小贴士"="Cold prevention recommendation";
//"给爱车一族的洗车建议"="car wash recommendation";
//"心情分享"="Share mood with you";
//"今日是否适宜进行户外运动"="Whether it's suitable for outdoor execise.";
//"出行是否需要带伞"="whether you should take an umbrella";
//"炎炎夏日防暑宝典"="heatstroke prevention Recommendation";


//CityViewController.m


"定位"="定位";
"搜索列表"="搜索列表";
"定位成功"="定位成功";
"定位失败,请手动选择城市"="定位失败,请手动选择城市";
"提示"="提示";
"请选择城市"="请选择城市";


"北京"="北京";

/* AirDeivceManageViewController */
"您没有网络,无法绑定新设备" = "您没有网络,无法绑定新设备";

"您没有网络,无法查看室外天气" = "您没有网络,无法查看室外天气";

